## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [2]:
import pandas as pd

In [3]:
# загружаем датасет
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [4]:
data.dtypes

age                int64
workclass         object
fnlwgt             int64
education         object
education-num      int64
marital-status    object
occupation        object
relationship      object
race              object
sex               object
capital-gain       int64
capital-loss       int64
hours-per-week     int64
native-country    object
salary            object
dtype: object

In [6]:
data.isnull().any()

age               False
workclass         False
fnlwgt            False
education         False
education-num     False
marital-status    False
occupation        False
relationship      False
race              False
sex               False
capital-gain      False
capital-loss      False
hours-per-week    False
native-country    False
salary            False
dtype: bool

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [7]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [8]:
data[data['sex'] == 'Male']['age'].mean()

39.43354749885268

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [9]:
data[data['native-country'] == 'United-States'].size / data['native-country'].size

13.43785510273026

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [10]:
data['salary'].unique()

array(['<=50K', '>50K'], dtype=object)

In [11]:
std_age_1 = data[data['salary'] == '>50K']['age'].std()
std_age_2 = data[data['salary'] == '<=50K']['age'].std()
print(std_age_1, std_age_2)

10.51902771985177 14.020088490824813

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [12]:
data[data['salary'] == '>50K']['education'].value_counts()

Bachelors       2221
HS-grad         1675
Some-college    1387
Masters          959
Prof-school      423
Assoc-voc        361
Doctorate        306
Assoc-acdm       265
10th              62
11th              60
7th-8th           40
12th              33
9th               27
5th-6th           16
1st-4th            6
Name: education, dtype: int64

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [19]:
data_stats = data[['age', 'sex', 'race']].groupby(['sex', 'race'], as_index = False).max()
data_stats

      sex                race  age
0  Female  Amer-Indian-Eskimo   80
1  Female  Asian-Pac-Islander   75
2  Female               Black   90
3  Female               Other   74
4  Female               White   90
5    Male  Amer-Indian-Eskimo   82
6    Male  Asian-Pac-Islander   90
7    Male               Black   90
8    Male               Other   77
9    Male               White   90

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [28]:
df = data[data['salary'] == '>50K'].groupby('marital-status')['marital-status'].count()
df

marital-status
Divorced                  463
Married-AF-spouse          10
Married-civ-spouse       6692
Married-spouse-absent      34
Never-married             491
Separated                  66
Widowed                    85
Name: marital-status, dtype: int64

In [29]:
sum_married = df[['Married-AF-spouse', 'Married-civ-spouse', 'Married-spouse-absent']].sum()
sum_single = df.sum() - sum_married
print(f"Number of married with salary >50K: {sum_married} \nNumber of single with salary >50K: {sum_single}")

Number of married with salary >50K: 6736
Number of single with salary >50K: 1105

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [30]:
max_hours = data['hours-per-week'].max()
df = data[data['hours-per-week'] == max_hours]

total_people = df.shape[0]
count_low_income = df[df['salary'] == '<=50K'].shape[0]
count_high_income = df[df['salary'] == '>50K'].shape[0]
percentage_low_income = round(count_low_income/total_people*100, 2)
percentage_high_income = round(count_high_income/total_people*100, 2)

print(f"Number people working {max_hours} hours with salary <=50K: {count_low_income} or {percentage_low_income}% \n\
Number of people working {max_hours} hours with salary >50K: {count_high_income} or {percentage_high_income}%")

Number people working 99 hours with salary <=50K: 60 or 70.59%
Number of people working 99 hours with salary >50K: 25 or 29.41%

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [31]:
df = data.groupby(['native-country', 'salary'])['hours-per-week'].mean().reset_index()
df.head(10)

  native-country salary  hours-per-week
0              ?  <=50K       40.164760
1              ?   >50K       45.547945
2       Cambodia  <=50K       41.416667
3       Cambodia   >50K       40.000000
4         Canada  <=50K       37.914634
5         Canada   >50K       45.641026
6          China  <=50K       37.381818
7          China   >50K       38.900000
8       Columbia  <=50K       38.684211
9       Columbia   >50K       50.000000

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответсвтуещей группы для каждого человека в новой колонке AgeGroup**

In [32]:
bins = [16, 35, 70, 100]
categories = ['young', 'adult', 'retiree']
data['AgeGroup'] = pd.cut(data['age'], bins, labels = categories)
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary,AgeGroup
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K,adult
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K,adult
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K,adult
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K,adult
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K,young

In [33]:
data.groupby('AgeGroup')['hours-per-week'].describe()

            count       mean        std  min   25%   50%   75%   max
AgeGroup
young     14925.0  38.827471  12.309624  1.0  35.0  40.0  40.0  99.0
adult     17096.0  42.277609  11.739182  1.0  40.0  40.0  48.0  99.0
retiree     540.0  26.677778  16.572209  1.0  14.0  25.0  40.0  99.0

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [34]:
df = data.groupby(['AgeGroup', 'salary'])['salary'].count().\
reset_index(level = 'AgeGroup')

df = df.rename(columns={'salary':'count'}).reset_index()
df

  salary AgeGroup  count
0  <=50K    young  13220
1   >50K    young   1705
2  <=50K    adult  11054
3   >50K    adult   6042
4  <=50K  retiree    446
5   >50K  retiree     94

In [42]:
df1 = df[df['salary'] == '>50K']
df1

  salary AgeGroup  count
1   >50K    young   1705
3   >50K    adult   6042
5   >50K  retiree     94

In [43]:
df1[df1['count'] == df1['count'].max()]

  salary AgeGroup  count
3   >50K    adult   6042

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [49]:
df = data.groupby('occupation').agg({'occupation':'count', 'age':'mean', 'hours-per-week':'min'})
df = df.rename(columns={'occupation':'num_of_people'}).reset_index()

In [50]:
df

           occupation  num_of_people        age  hours-per-week
0                   ?           1843  40.882800               1
1        Adm-clerical           3770  36.964456               1
2        Armed-Forces              9  30.222222               8
3        Craft-repair           4099  39.031471               1
4     Exec-managerial           4066  42.169208               1
5     Farming-fishing            994  41.211268               2
6   Handlers-cleaners           1370  32.165693               2
7   Machine-op-inspct           2002  37.715285               1
8       Other-service           3295  34.949621               1
9     Priv-house-serv            149  41.724832               4
10     Prof-specialty           4140  40.517633               1
11    Protective-serv            649  38.953775               3
12              Sales           3650  37.353973               2
13       Tech-support            928  37.022629               3
14   Transport-moving           1597  40.197871               5

In [95]:
def func_filter(dataset, max_age: int, min_work_hours: int):
    
    df = dataset.groupby('occupation').agg({'occupation':'count', 'age':'mean', 'hours-per-week':'min'})
    df = df.rename(columns={'occupation':'num_of_people'}).reset_index()
    filtered_occupation = df[(df['age'] < max_age) & (df['hours-per-week'] >= min_work_hours)]['occupation'].values[:]
    
    return str(filtered_occupation)

In [96]:
func_filter(data, 40, 5)

"['Armed-Forces']"